<?php
/**
 * デフォルトは上に
 */
return [
  // 色
  'colors' => [
    'primary' => 'Primary',
    'secondary' => 'Secondary',
    'success' => 'Success',
    'danger' => 'Danger',
    'warning' => 'Warning',
    'info' => 'Info',
    'light' => 'Light',
    'dark' => 'Dark',
  ],
  // 要因区分マスター
  'comment_type' => [
    1 => 'ああああ',
    2 => 'いいいいいい',
    3 => 'うううううううう',
    4 => 'えええ',
    5 => 'おおおおお',
  ],
  // 工種
  'construction_type' => [
    1 => '法枠工',
  ],
  // 費用タイプ
  'cost_type' => [
    'label' => '費用タイプ',
    'params' => [
      1 => '材料費',
      2 => '外注費',
    ]
  ],
  // 計算式タイプ
  'formula_type' => [
    'm01' => '材料費01',
    'o01' => '外注費01',
    'o02' => '外注費02',
  ],
  // 無効フラグ
  'invalid' => [
    'label' => '無効フラグ',
    'params' => [
      0 => '有効',
      1 => '無効',
    ]
  ],
  // カスタム表示フラグ
  'is_custom' => [
    'label' => 'カスタム表示フラグ',
    'params' => [
      0 => '非表示',
      1 => '表示',
    ]
  ],
  // モード
  'mode' => [
    1 => '予算入力',
    2 => '実績入力',
    3 => '分析実行',
  ],
  // 工程タイプ
  'process_type' => [
    'label' => '工程',
    'params' => [
      1 => '準備・撤去工',
      2 => '法面清掃工',
      3 => 'ラス張り工',
      4 => '法枠組立工',
      5 => '法枠吹付工',
      6 => '枠内吹付工',
      7 => '場内清掃工',
    ]
  ],
  // 単位マスター
  /*
  'unit_type' => [
    'label' => '単位',
    'params' => [
      14 => 'mm',
      1 => 'm',
      2 => 'm2',
      3 => 'm3',
      4 => '㎏',
      15 => 't',
      16 => '%',
      5 => '回',
      6 => '本',
      7 => '枚',
      8 => '組',
      9 => '袋',
      13 => '個',
      11 => '人',
      12 => '円',
    ]
  ],
  */
];
