<?php
/**
 * デフォルトは上に
 */
return [
  // CD01 斜直高（市場単価該当項目）
  'straight_high_type' => [
    'code' => 'CD01',
    'label' => '直高（市場単価該当項目）',
    'short' => '直高',
    'note' => '市場単価該当項目',
    'params' => [
      1 => '45m以下（市場単価適用範囲）',
      2 => '45mを超える',
    ]
  ],
  // CD02	圧送距離（市場単価該当項目）
  'distance_type' => [
    'code' => 'CD02',
    'label' => '圧送距離（市場単価該当項目）',
    'short' => '圧送距離',
    'note' => '市場単価該当項目',
    'params' => [
      1 => '100m未満（市場単価範囲）',
      2 => '100m以上',
      3 => '200m以上',
    ]
  ],
  // CD03	法枠規格
  'frame_width_type' => [
    'code' => 'CD03',
    'label' => '法枠規格',
    'params' => [
      1 => 'F150',
      2 => 'F200',
      3 => 'F300',
      4 => 'F400',
      5 => 'F500',
      6 => 'F600',
    ]
  ],
  // CD04	地山の不陸（枠断面の50％を超える場合は市場単価適用外）
  'roughness_type' => [
    'code' => 'CD04',
    'label' => '地山の不陸（枠断面の50％を超える場合は市場単価適用外）',
    'short' => '地山の不陸',
    'note' => '枠断面の50％を超える場合は市場単価適用外',
    'params' => [
      1 => '10%～30%以下（F150:15mm, F200:20mm, F300:30mm, F400:40mm, F500:50mm, F600:60mm）',
      2 => '30%～50％以下（F150:45mm, F200:60mm, F300:90mm, F400:120mm, F500:150mm, F600:180mm）',
      3 => '50%を超える',
    ]
  ],
  // CD05	全体面積に対する不陸の割合
  'roughness_rate_type' => [
    'code' => 'CD05',
    'label' => '全体面積に対する不陸の割合',
    'params' => [
      1 => '0％～30％',
      2 => '30％～50％',
      3 => '50％～80％',
      4 => '80％以上',
    ]
  ],
  // CD06	斜面勾配
  'gradient_type' => [
    'code' => 'CD06',
    'label' => '斜面勾配',
    'params' => [
      1 => '30°以上～45°未満',
      2 => '45°以上～60°未満',
      3 => '60°以上',
    ]
  ],
  // CD07	法長(平均的な）
  'slope_length_type' => [
    'code' => 'CD07',
    'label' => '法長(平均的な）',
    'short' => '法長',
    'note' => '平均的な',
    'params' => [
      1 => '10m未満',
      2 => '10m以上, 20m未満',
      3 => '20m以上, 30m未満',
      4 => '30n以上, 40m未満',
      5 => '40m以上, 50m未満',
      6 => '50m以上',
    ]
  ],
  // CD08	施工延長（法尻）
  'extension_type' => [
    'code' => 'CD08',
    'label' => '施工延長（法尻）',
    'short' => '施工延長',
    'note' => '法尻',
    'params' => [
      1 => '20m未満',
      2 => '20m以上, 40m未満',
      3 => '40m以上, 60m未満',
      4 => '60m以上, 80m未満',
      5 => '80m以上, 100m未満',
      6 => '100m以上',
    ]
  ],
  // CD09	面積
  // params追加時下記調整
  // html/assets/scripts/free_form.js
  'area_type' => [
    'code' => 'CD09',
    'label' => '面積',
    'params' => [
      1 => '100㎡未満',
      2 => '100㎡以上, 500㎡未満',
      3 => '500㎡以上, 1000㎡未満',
      4 => '1000㎡以上',
    ]
  ],
  // CD10	地山の硬軟・ハンマードリル使用率
  'utilization_type' => [
    'code' => 'CD10',
    'label' => '地山の硬軟・ハンマードリル使用率',
    'params' => [
      1 => '0％～30％',
      2 => '30％以上,50％未満',
      3 => '50％以上，80％未満',
      4 => '100%',
    ]
  ],
  // CD11	スターラップ
  'is_stirrup' => [
    'code' => 'CD11',
    'label' => 'スターラップ',
    'params' => [
      1 => 'あり',
      2 => 'なし',
    ]
  ],
  // CD12	運搬方法
  'transportation_type' => [
    'code' => 'CD12',
    'label' => '運搬方法',
    'params' => [
      1 => 'トラック（含む移動式クレーン）',
      2 => 'クレーン（トラッククレーン・ラフタークレーン）',
      3 => 'モノレール',
      4 => 'ウインチ',
      5 => '索道',
      6 => 'インクライン',
      7 => 'その他',
    ]
  ],
  // CD13	材料小運搬（小段・人力)
  'small_transportation_type' => [
    'code' => 'CD13',
    'label' => '材料小運搬（小段・人力)',
    'short' => '材料小運搬',
    'note' => '小段・人力',
    'params' => [
      1 => '50m未満',
      2 => '50m以上, 100m未満',
      3 => '100m以上, 200m未満',
      4 => '200m以上',
    ]
  ],
  // CD14	コテ仕上げの有無
  'is_trowel' => [
    'code' => 'CD14',
    'label' => 'コテ仕上げの有無',
    'params' => [
      1 => 'あり',
      2 => 'なし',
    ]
  ],
  // CD15	水切りモルタル（横梁）の有無
  'is_mortar' => [
    'code' => 'CD15',
    'label' => '水切りモルタル（横梁）の有無',
    'params' => [
      1 => 'あり',
      2 => 'なし',
    ]
  ],
  // CD16	材料練混ぜ方法
  'mixing_type' => [
    'code' => 'CD16',
    'label' => '材料練混ぜ方法',
    'params' => [
      1 => '現場練り',
      2 => '工場生産',
    ]
  ],
  // CD17	プラント場内移動
  'is_movement' => [
    'code' => 'CD17',
    'label' => 'プラント場内移動',
    'params' => [
      1 => '場内移動あり',
      2 => '場内移動なし',
    ]
  ],
];
